app/controllers/movies_controller.rb

 def index
     @movies = Movie.all
     @all_ratings = Movie.all_ratings

     if params[:ratings] != nil #if a rating was clicked
     	@ratings_selected = params[:ratings].keys #set checked boxes(keys) to variable
     	session[:rating_selections] = @ratings_selected #store the checked ratings in a session

     end

     @checked_ratings = session[:rating_selections] #set this session as a variable

     if params[:title_sort] == 'title' #if the title header was clicked
     	session[:title_sort] = params[:title_sort] #store that in a session
     	session[:release_date_sort] = nil #release date cannot also be clicked, set session to nil


     elsif params[:release_date_sort] == 'release_date' #if the release date header is clicked
     	session[:release_date_sort] = params[:release_date_sort] #store that in a session
     	session[:title_sort] = nil #title cannot also be clicked, set session to nil

     end

     if (session[:title_sort] != nil)
     	@movies = Movie.where(:rating=>@checked_ratings).order(session[:title_sort])
---
SELECT "movies".* FROM "movies" ORDER BY release
SELECT "movies".* FROM "movies" WHERE "rating"."PG-13" = 'PG-13' AND "rating"."R" = 'R' AND "rating"."NC-17" = 'NC-17'